package com.egco428.trysub

import java.lang.reflect.Array

class QuestionAnswer {

    public var MyQuestion = arrayOf(
            //ข้อ1
            arrayOf("1. Question"),
            //ข้อ2
            arrayOf("2. Question"),
            //ข้อ3
            arrayOf("3. Question"),
            //ข้อ4
            arrayOf("4. Question"),
            //ข้อ5
            arrayOf("5. Question"),
            //ข้อ6
            arrayOf("6. Question"),
            //ข้อ7
            arrayOf("7. Question"),
            //ข้อ8
            arrayOf("8. Question"),
            //ข้อ9
            arrayOf("9. Question"),
            //ข้อ10
            arrayOf("10. Question")
    )

  public val MyChoice = arrayOf(
          //ข้อ1
          arrayOf(
                  arrayOf("1.1","1.1","1.1"), //1
                  arrayOf("1.2","1.2","1.2"), //2
                  arrayOf("1.3","1.3","1.3"), //3
                  arrayOf("1.4","1.4","1.4"), //4
                  arrayOf("1.5","1.5","1.5"), //5
                  arrayOf("1.6","1.6","1.6"), //6
                  arrayOf("1.7","1.7","1.7"), //7
                  arrayOf("1.8","8.2","1.3"), //8
                  arrayOf("1.9","1.9","1.9"), //9
                  arrayOf("1.10","1.10","1.10") //10
          ),
          //ข้อ2
          arrayOf(
                  arrayOf("2.1","1.1","1.1"), //1
                  arrayOf("2.2","1.2","1.2"), //2
                  arrayOf("2.3","1.3","1.3"), //3
                  arrayOf("2.4","1.4","1.4"), //4
                  arrayOf("2.5","1.5","1.5"), //5
                  arrayOf("2.6","1.6","1.6"), //6
                  arrayOf("2.7","1.7","1.7"), //7
                  arrayOf("2.8","8.2","1.3"), //8
                  arrayOf("2.9","1.9","1.9"), //9
                  arrayOf("2.10","1.10","1.10") //10
          ),
          //ข้อ3
          arrayOf(
                  arrayOf("3.1","1.1","1.1"), //1
                  arrayOf("3.2","1.2","1.2"), //2
                  arrayOf("3.3","1.3","1.3"), //3
                  arrayOf("3.4","1.4","1.4"), //4
                  arrayOf("3.5","1.5","1.5"), //5
                  arrayOf("3.6","1.6","1.6"), //6
                  arrayOf("3.7","1.7","1.7"), //7
                  arrayOf("3.8","8.2","1.3"), //8
                  arrayOf("3.9","1.9","1.9"), //9
                  arrayOf("3.10","1.10","1.10") //10
          ),
          //ข้อ4
          arrayOf(
                  arrayOf("4.1","1.1","1.1"), //1
                  arrayOf("4.2","1.2","1.2"), //2
                  arrayOf("4.3","1.3","1.3"), //3
                  arrayOf("4.4","1.4","1.4"), //4
                  arrayOf("4.5","1.5","1.5"), //5
                  arrayOf("4.6","1.6","1.6"), //6
                  arrayOf("4.7","1.7","1.7"), //7
                  arrayOf("4.8","8.2","1.3"), //8
                  arrayOf("4.9","1.9","1.9"), //9
                  arrayOf("4.10","1.10","1.10") //10
          ),
          //ข้อ5
          arrayOf(
                  arrayOf("5.1","1.1","1.1"), //1
                  arrayOf("5.2","1.2","1.2"), //2
                  arrayOf("5.3","1.3","1.3"), //3
                  arrayOf("5.4","1.4","1.4"), //4
                  arrayOf("5.5","1.5","1.5"), //5
                  arrayOf("5.6","1.6","1.6"), //6
                  arrayOf("5.7","1.7","1.7"), //7
                  arrayOf("5.8","8.2","1.3"), //8
                  arrayOf("5.9","1.9","1.9"), //9
                  arrayOf("5.10","1.10","1.10") //10
          ),
          //ข้อ6
          arrayOf(
                  arrayOf("6.1","1.1","1.1"), //1
                  arrayOf("6.2","1.2","1.2"), //2
                  arrayOf("6.3","1.3","1.3"), //3
                  arrayOf("6.4","1.4","1.4"), //4
                  arrayOf("6.5","1.5","1.5"), //5
                  arrayOf("6.6","1.6","1.6"), //6
                  arrayOf("6.7","1.7","1.7"), //7
                  arrayOf("6.8","8.2","1.3"), //8
                  arrayOf("6.9","1.9","1.9"), //9
                  arrayOf("6.10","1.10","1.10") //10
          ),
          //ข้อ7
          arrayOf(
                  arrayOf("7.1","1.1","1.1"), //1
                  arrayOf("7.2","1.2","1.2"), //2
                  arrayOf("7.3","1.3","1.3"), //3
                  arrayOf("7.4","1.4","1.4"), //4
                  arrayOf("7.5","1.5","1.5"), //5
                  arrayOf("7.6","1.6","1.6"), //6
                  arrayOf("7.7","1.7","1.7"), //7
                  arrayOf("7.8","8.2","1.3"), //8
                  arrayOf("7.9","1.9","1.9"), //9
                  arrayOf("7.10","1.10","1.10") //10
          ),
          //ข้อ8
          arrayOf(
                  arrayOf("8.1","1.1","1.1"), //1
                  arrayOf("8.2","1.2","1.2"), //2
                  arrayOf("8.3","1.3","1.3"), //3
                  arrayOf("8.4","1.4","1.4"), //4
                  arrayOf("8.5","1.5","1.5"), //5
                  arrayOf("8.6","1.6","1.6"), //6
                  arrayOf("8.7","1.7","1.7"), //7
                  arrayOf("8.8","8.2","1.3"), //8
                  arrayOf("8.9","1.9","1.9"), //9
                  arrayOf("8.10","1.10","1.10") //10
          ),
          //ข้อ9
          arrayOf(
                  arrayOf("9.1","1.1","1.1"), //1
                  arrayOf("9.2","1.2","1.2"), //2
                  arrayOf("9.3","1.3","1.3"), //3
                  arrayOf("9.4","1.4","1.4"), //4
                  arrayOf("9.5","1.5","1.5"), //5
                  arrayOf("9.6","1.6","1.6"), //6
                  arrayOf("9.7","1.7","1.7"), //7
                  arrayOf("9.8","8.2","1.3"), //8
                  arrayOf("9.9","1.9","1.9"), //9
                  arrayOf("9.10","1.10","1.10") //10
          ),
          //ข้อ9
          arrayOf(
                  arrayOf("10.1","1.1","1.1"), //1
                  arrayOf("10.2","1.2","1.2"), //2
                  arrayOf("10.3","1.3","1.3"), //3
                  arrayOf("10.4","1.4","1.4"), //4
                  arrayOf("10.5","1.5","1.5"), //5
                  arrayOf("10.6","1.6","1.6"), //6
                  arrayOf("10.7","1.7","1.7"), //7
                  arrayOf("10.8","8.2","1.3"), //8
                  arrayOf("10.9","1.9","1.9"), //9
                  arrayOf("10.10","1.10","1.10") //10
          )
  )

    public val CorrectAnswer = arrayOf(
            //ข้อ1
            arrayOf("1.1"),
            //ข้อ2
            arrayOf("2.1"),
            //ข้อ3
            arrayOf("3.1"),
            //ข้อ4
            arrayOf("4.1"),
            //ข้อ5
            arrayOf("5.1"),
            //ข้อ6
            arrayOf("6.1"),
            //ข้อ7
            arrayOf("7.1"),
            //ข้อ8
            arrayOf("8.1"),
            //ข้อ9
            arrayOf("9.1"),
            //ข้อ10
            arrayOf("10.1")
    )
}