package com.egco428.trysub

import java.lang.reflect.Array

class QuestionAnswer {

    public var MyQuestion = arrayOf(
            //LV1
            arrayOf(
                //ข้อ1
                "1. Ant",
                //ข้อ2
                "2. Bee",
                //ข้อ3
                "3. Cat",
                //ข้อ4
                "4. Dog",
                //ข้อ5
                "5. Flower",
                //ข้อ6
                "6. Ear",
                //ข้อ7
                "7. Mouth",
                //ข้อ8
                "8. Leg",
                //ข้อ9
                "9. Yellow",
                //ข้อ10
                "10. Zoo"
            ),
            //LV2
            arrayOf(
                    //ข้อ1
                    "1. Answer",
                    //ข้อ2
                    "2. Back",
                    //ข้อ3
                    "3. Because",
                    //ข้อ4
                    "4. Earth",
                    //ข้อ5
                    "5. Money",
                    //ข้อ6
                    "6. Center",
                    //ข้อ7
                    "7. Live",
                    //ข้อ8
                    "8. Paper",
                    //ข้อ9
                    "9. Ready",
                    //ข้อ10
                    "10. Table"
            ),
            //LV3
            arrayOf(
                    //ข้อ1
                    "1. Air",
                    //ข้อ2
                    "2. Best",
                    //ข้อ3
                    "3. Complete",
                    //ข้อ4
                    "4. During",
                    //ข้อ5
                    "5. Enough",
                    //ข้อ6
                    "6. Family",
                    //ข้อ7
                    "7. Happen",
                    //ข้อ8
                    "8. Remember",
                    //ข้อ9
                    "9. Without",
                    //ข้อ10
                    "10. Together"
            ),
            //LV4
            arrayOf(
                    //ข้อ1
                    "1. Build",
                    //ข้อ2
                    "2. Differ",
                    //ข้อ3
                    "3. Even",
                    //ข้อ4
                    "4. Govern",
                    //ข้อ5
                    "5. Letter",
                    //ข้อ6
                    "6. Measure",
                    //ข้อ7
                    "7. Mountain",
                    //ข้อ8
                    "8. Often",
                    //ข้อ9
                    "9. Pattern",
                    //ข้อ10
                    "10. Product"
            ),
            //LV5
            arrayOf(
                    //ข้อ1
                    "1. About",
                    //ข้อ2
                    "2. Hate",
                    //ข้อ3
                    "3. Little",
                    //ข้อ4
                    "4. Through",
                    //ข้อ5
                    "5. Complain",
                    //ข้อ6
                    "6. Department",
                    //ข้อ7
                    "7. Frequent",
                    //ข้อ8
                    "8. Geography",
                    //ข้อ9
                    "9. Immediate",
                    //ข้อ10
                    "10. Medicine"
            ),
            //LV6
            arrayOf(
                    //ข้อ1
                    "1. Assist",
                    //ข้อ2
                    "2. Biograph",
                    //ข้อ3
                    "3. Boycott",
                    //ข้อ4
                    "4. Candidate",
                    //ข้อ5
                    "5. Decorate",
                    //ข้อ6
                    "6. Empire",
                    //ข้อ7
                    "7. Finance",
                    //ข้อ8
                    "8. Garbage",
                    //ข้อ9
                    "9. Independent",
                    //ข้อ10
                    "10. Massage"
            ),
            //LV7
            arrayOf(
                    //ข้อ1
                    "1. complicate",
                    //ข้อ2
                    "2. cooperate",
                    //ข้อ3
                    "3. economic",
                    //ข้อ4
                    "4. hesitate",
                    //ข้อ5
                    "5. handle",
                    //ข้อ6
                    "6. hostage",
                    //ข้อ7
                    "7. hut",
                    //ข้อ8
                    "8. insecure",
                    //ข้อ9
                    "9. intercept",
                    //ข้อ10
                    "10. investigate"

            ),
            //LV8
            arrayOf(
                    //ข้อ1
                    "1. Evaluate",
                    //ข้อ2
                    "2. Fatigue",
                    //ข้อ3
                    "3. Glance",
                    //ข้อ4
                    "4. Helmet",
                    //ข้อ5
                    "5. Humor",
                    //ข้อ6
                    "6. Instinct ",
                    //ข้อ7
                    "7. Phenomenon",
                    //ข้อ8
                    "8. Prototype",
                    //ข้อ9
                    "9. Rampage",
                    //ข้อ10
                    "10. Scandal"
            ),
            //LV9
            arrayOf(
                    //ข้อ1
                    "1. Rectangle",
                    //ข้อ2
                    "2. Paramount",
                    //ข้อ3
                    "3. Nominee",
                    //ข้อ4
                    "4. Mortgage",
                    //ข้อ5
                    "5. Lightning",
                    //ข้อ6
                    "6. Insufficient",
                    //ข้อ7
                    "7. Illustrate",
                    //ข้อ8
                    "8. Harass",
                    //ข้อ9
                    "9. Surround",
                    //ข้อ10
                    "10. Suppress"
            ),
            //LV10
            arrayOf(
                    //ข้อ1
                    "1. Rational",
                    //ข้อ2
                    "2. Prostitute",
                    //ข้อ3
                    "3. Prejudice",
                    //ข้อ4
                    "4. Pandemic",
                    //ข้อ5
                    "5. Naughty",
                    //ข้อ6
                    "6. Mandate",
                    //ข้อ7
                    "7. Jeopardy",
                    //ข้อ8
                    "8. Self-employed",
                    //ข้อ9
                    "9. Military service",
                    //ข้อ10
                    "10. Entrepreneur"
            )
    )

  public val MyChoice = arrayOf(
          //LV1
          arrayOf(
                  arrayOf("มด","ปาก","ฟัน"), //1
                  arrayOf("แขน","มด","ผึ้ง"), //2
                  arrayOf("ขา","แมว","เสือ"), //3
                  arrayOf("สุนัข","มด","สีแดง"), //4
                  arrayOf("หู","ดอกไม้","ข้าว"), //5
                  arrayOf("ปาก","ตา","หู"), //6
                  arrayOf("ผม","ปาก","ไก่"), //7
                  arrayOf("แขน","มือ","ขา"), //8
                  arrayOf("สีฟ้า","สีแดง","สีเหลือง"), //9
                  arrayOf("สวนสัตว์","บ้าน","โรงแรม") //10
          ),
          //LV2
          arrayOf(
                  arrayOf("ความหลัง","คำตอบ","ความลับ"), //1
                  arrayOf("กลับ","ไปข้างหน้า","พรุ่งนี้"), //2
                  arrayOf("คำตอบ","คำถาม","เพราะว่า"), //3
                  arrayOf("ดาวอังาคร","ดวงจันทร์","โลก"), //4
                  arrayOf("เงิน","รูปภาพ","กระดาษ"), //5
                  arrayOf("ข้างบน","ตรงกลาง","ข้างๆ"), //6
                  arrayOf("อาศัย","บ้าน","ชีวิต"), //7
                  arrayOf("กระดาษ","กล่อง","ชีวิต"), //8
                  arrayOf("ไม่พร้อม","ผู้หญิง","พร้อม"), //9
                  arrayOf("เก้าอี้","ปิงปอง","โต๊ะ") //10
          ),
          //LV3
          arrayOf(
                  arrayOf("อากาศ","น้ำ","ดิน"), //1
                  arrayOf("แย่","เตียง","ดีที่สุด"), //2
                  arrayOf("สมบูรณ์","คอมพิวเตอร์","คอมมอน"), //3
                  arrayOf("ทำ","ช่วงระหว่าง","พอเพียง"), //4
                  arrayOf("เพียงพอ","ไม่พอ","ดีเยี่ยม"), //5
                  arrayOf("แม่","ครอบครัว","พ่อ"), //6
                  arrayOf("เกิดขึ้น","อะไร","มี"), //7
                  arrayOf("จดจำ","สมาชิก","ยางลบ"), //8
                  arrayOf("อะไร","กับ","ปราศจาก"), //9
                  arrayOf("ด้วยกัน","สอง","ถึง") //10
          ),
          //LV4
          arrayOf(
                  arrayOf("พอแล้ว","สร้าง","นก"), //1
                  arrayOf("เกิด","ดิฟท์รถ","แตกต่าง"), //2
                  arrayOf("แม้ว่า","เลขคึ่","คู่แข่ง"), //3
                  arrayOf("ถุงมือ","ปกครอง","แพะ"), //4
                  arrayOf("จดหมาย","พร้อม","ดีกว่า"), //5
                  arrayOf("โบสถ์","วัด","พร้อมแล้ว"), //6
                  arrayOf("ทะเล","น้ำตก","ภูเขา"), //7
                  arrayOf("บ่อยครั้ง","หน้าต่าง","ระหว่าง"), //8
                  arrayOf("รูปแบบ","ต่อสู้","ส่วนประกอบ"), //9
                  arrayOf("มืออาชีพ","ผู้เชี่ยวชาญ","ผลผลิต") //10
          ),
          //LV5
          arrayOf(
                  arrayOf("เครื่องบิน","เกี่ยวกับ","จัดการ"), //1
                  arrayOf("เกลียด","หมวก","มี"), //2
                  arrayOf("ใหญ่","ขวด","เล็กน้อย"), //3
                  arrayOf("โดย","คิด","ผ่าน"), //4
                  arrayOf("ความคิด","บ่น","สมบูรณ์"), //5
                  arrayOf("แผนก","ห้องพัก","บ้าน"), //6
                  arrayOf("ปลา","คลื่น","ความถี่"), //7
                  arrayOf("กราฟฟิค","ภูมิศาสตร์","รูปภาพ"), //8
                  arrayOf("ทันที","รูปภาพ","อิ่ม"), //9
                  arrayOf("กล้อง","ปาณกลาง","ยา") //10
          ),
          //LV6
          arrayOf(
                  arrayOf("ช่วยเหลือ","ต่อสู้","ส่วนเกิน"), //1
                  arrayOf("ชีวิทยา","ประวัติบุคคล","กราฟชีวิต"), //2
                  arrayOf("วัยรุ่น","เด็กผู้ชาย","คว่ำบาตร"), //3
                  arrayOf("ตรวจสอบ","กระป๋อง","คู่แข่ง"), //4
                  arrayOf("ห้าง","จระเข้","ตกแต่ง"), //5
                  arrayOf("อาณาจักร","ผู้ปกครอง","ตา"), //6
                  arrayOf("บัญชี","การเงิน","สิ้นสุด"), //7
                  arrayOf("ขยะ","ขวดน้ำ","กระป๋อง"), //8
                  arrayOf("อาณาจักร","ร้อมกรอบ","อิศระ"), //9
                  arrayOf("ข้อความ","นวด","มาสตราส")//10

          ),
          //LV7
          arrayOf(
                  arrayOf("สมบูรณ์","ผ่าน","ซับซ้อน"), //1
                  arrayOf("ร่วมมือ","จระเข้","คอมพิวเตอร์"), //2
                  arrayOf("เศรษฐกิจ","การเมือง","หุ่นส่วน"), //3
                  arrayOf("ผิดพลาด","ลังเล","มั่นใจ"), //4
                  arrayOf("อิสระ","มือ","ควบคุม"), //5
                  arrayOf("แอร์","ขายประกัน","ตัวประกัน"), //6
                  arrayOf("กระท่อม","หมวก","เกลียด"), //7
                  arrayOf("พิสูจน์","ลังเล","ไม่มั่นคง"), //8
                  arrayOf("ขวางกั้น","ยอมรับ","ไม่มั่นคง"), //9
                  arrayOf("สืบสวน","ไม่มั่นคง","ลังเล") //10
          ),
          //LV8
          arrayOf(
                  arrayOf("ช้าง","ประเมิน","พิสูจน์"), //1
                  arrayOf("เหนื่อยล้า","ความกลัว","ธง"), //2
                  arrayOf("ชำเลือง","ประเทศ","ขัย"), //3
                  arrayOf("หมวกแก็ป","เกลียด","หมวกกันน็อค"), //4
                  arrayOf("อารมณ์ขัน","โกรธ","นิ่ง"), //5
                  arrayOf("ไม่คิด","ติดตั้ง","สัญชาติญาณ"), //6
                  arrayOf("ผู้เชี่ยวชาญ","ปรากฏการณ์","ชนิดรูปภาพ"), //7
                  arrayOf("โครมไฟ","ต้นแบบ","ความคิด"), //8
                  arrayOf("อารมณ์ขัน","นิ่งเฉย","เกรี้ยวกราด"), //9
                  arrayOf("อื้อฉาว","ตำแหน่ง","ตรวจสอบ") //10
          ),
          //LV9
          arrayOf(
                  arrayOf("วงกลม","สามเหลี่ยม","สี่เหลี่ยมผืนผ้า"), //1
                  arrayOf("ยิ่งใหญ่","เล็กน้อย","ยึกครอง"), //2
                  arrayOf("น้อย","หุ่นเชิด","ประชด"), //3
                  arrayOf("จำนอง","ขายประกัน","ซื้อหุ่้น"), //4
                  arrayOf("ดวงไฟ","สายชาร์จ","สายฟ้า"), //5
                  arrayOf("ส่วนเกิน","ไม่เพียงพอ","อิ่ม"), //6
                  arrayOf("ดุ","บ่น","อธิบาย"), //7
                  arrayOf("กุ้งมังกร","ม้า","กวนใจ"), //8
                  arrayOf("ล้อมรอบ","พุ่งนี้","สำรวจ"), //9
                  arrayOf("เซอร์ไพซ์","ระงับ","กด") //10
          ),
          //LV10
          arrayOf(
                  arrayOf("ความมีเหตุผล","งี่เง่า","โวยวาย"), //1
                  arrayOf("10.2","โสเภณี","1.2"), //2
                  arrayOf("10.3","1.3","อคติ"), //3
                  arrayOf("10.4","โรคระบาด","1.4"), //4
                  arrayOf("10.5","ซุกซน","1.5"), //5
                  arrayOf("คำสั่ง","1.6","1.6"), //6
                  arrayOf("10.7","1.7","อันตราย"), //7
                  arrayOf("10.8","ทำธุรกิจส่วนตัว","1.3"), //8
                  arrayOf("10.9","1.9","การเกณฑ์ทหาร"), //9
                  arrayOf("ผู้ประกอบการ","1.10","1.10") //10
          )
  )

    public val CorrectAnswer = arrayOf(
            //LV1
            arrayOf(
                //ข้อ1
                "มด",
                //ข้อ2
                "ผึ้ง",
                //ข้อ3
                "แมว",
                //ข้อ4
                "สุนัข",
                //ข้อ5
                "ดอกไม้",
                //ข้อ6
                "หู",
                //ข้อ7
                "ปาก",
                //ข้อ8
                "ขา",
                //ข้อ9
                "สีเหลือง",
                //ข้อ10
                "สวนสัตว์"
            ),
            //LV2
            arrayOf(
                    //ข้อ1
                    "คำตอบ",
                    //ข้อ2
                    "กลับ",
                    //ข้อ3
                    "เพราะว่า",
                    //ข้อ4
                    "โลก",
                    //ข้อ5
                    "เงิน",
                    //ข้อ6
                    "ตรงกลาง",
                    //ข้อ7
                    "อาศัย",
                    //ข้อ8
                    "กระดาษ",
                    //ข้อ9
                    "พร้อม",
                    //ข้อ10
                    "โต๊ะ"
            ),
            //LV3
            arrayOf(
                    //ข้อ1
                    "อากาศ",
                    //ข้อ2
                    "ดีที่สุด",
                    //ข้อ3
                    "สมบูรณ์",
                    //ข้อ4
                    "ช่วงระหว่าง",
                    //ข้อ5
                    "เพียงพอ",
                    //ข้อ6
                    "ครอบครัว",
                    //ข้อ7
                    "เกิดขึ้น",
                    //ข้อ8
                    "จดจำ",
                    //ข้อ9
                    "ปราศจาก",
                    //ข้อ10
                    "ด้วยกัน"
            ),
            //LV4
            arrayOf(
                    //ข้อ1
                    "สร้าง",
                    //ข้อ2
                    "แตกต่าง",
                    //ข้อ3
                    "แม้ว่า",
                    //ข้อ4
                    "ปกครอง",
                    //ข้อ5
                    "จดหมาย",
                    //ข้อ6
                    "วัด",
                    //ข้อ7
                    "ภูเขา",
                    //ข้อ8
                    "บ่อยครั้ง",
                    //ข้อ9
                    "รูปแบบ",
                    //ข้อ10
                    "ผลผลิต"
            ),
            //LV5
            arrayOf(
                    //ข้อ1
                    "เกี่ยวกับ",
                    //ข้อ2
                    "เกลียด",
                    //ข้อ3
                    "เล็กน้อย",
                    //ข้อ4
                    "ผ่าน",
                    //ข้อ5
                    "บ่น",
                    //ข้อ6
                    "แผนก",
                    //ข้อ7
                    "ความถี่",
                    //ข้อ8
                    "ภูมิศาสตร์",
                    //ข้อ9
                    "ทันที",
                    //ข้อ10
                    "ยา"
            ),
            //LV6
            arrayOf(
                    //ข้อ1
                    "ช่วยเหลือ",
                    //ข้อ2
                    "ประวัติบุคคล",
                    //ข้อ3
                    "คว่ำบาตร",
                    //ข้อ4
                    "คู่แข่ง",
                    //ข้อ5
                    "ตกแต่ง",
                    //ข้อ6
                    "อาณาจักร",
                    //ข้อ7
                    "การเงิน",
                    //ข้อ8
                    "ขยะ",
                    //ข้อ9
                    "อิสระ",
                    //ข้อ10
                    "นวด"
            ),
            //LV7
            arrayOf(
                    //ข้อ1
                    "ซับซ้อน",
                    //ข้อ2
                    "ร่วมมือ",
                    //ข้อ3
                    "เศรษฐกิจ",
                    //ข้อ4
                    "ลังเล",
                    //ข้อ5
                    "ควบคุม",
                    //ข้อ6
                    "ตัวประกัน",
                    //ข้อ7
                    "กระท่อม",
                    //ข้อ8
                    "ไม่มั่นคง",
                    //ข้อ9
                    "ขวางกั้น",
                    //ข้อ10
                    "สืบสวน"
            ),
            //LV8
            arrayOf(
                    //ข้อ1
                    "ประเมิน",
                    //ข้อ2
                    "เหนื่อยล้า",
                    //ข้อ3
                    "ชำเลือง",
                    //ข้อ4
                    "หมวกกันน็อค",
                    //ข้อ5
                    "อารมณ์ขัน",
                    //ข้อ6
                    "สัญชาตญาณ",
                    //ข้อ7
                    "ปรากฏการณ์",
                    //ข้อ8
                    "ต้นแบบ",
                    //ข้อ9
                    "เกรี้ยวกราด",
                    //ข้อ10
                    "1ื้อฉาว"
            ),
            //LV9
            arrayOf(
                    //ข้อ1
                    "สี่เหลี่ยมผืนผ้า",
                    //ข้อ2
                    "ยิ่งใหญ่",
                    //ข้อ3
                    "หุ่นเชิด",
                    //ข้อ4
                    "จำนอง",
                    //ข้อ5
                    "สายฟ้า",
                    //ข้อ6
                    "ไม่เพียงพอ",
                    //ข้อ7
                    "อธิบาย",
                    //ข้อ8
                    "กวนใจ",
                    //ข้อ9
                    "ล้อมรอบ",
                    //ข้อ10
                    "ระงับ"
            ),
            //LV10
            arrayOf(
                    //ข้อ1
                    "ความมีเหตุผล",
                    //ข้อ2
                    "โสเภณี",
                    //ข้อ3
                    "อคติ",
                    //ข้อ4
                    "โรคระบาด",
                    //ข้อ5
                    "ซุกซน",
                    //ข้อ6
                    "คำสั่ง",
                    //ข้อ7
                    "อันตราย",
                    //ข้อ8
                    "ทำธุรกิจส่วนตัว",
                    //ข้อ9
                    "การเกณฑ์ทหาร",
                    //ข้อ10
                    "ผู้ประกอบการ"
            )
    )
}